<template>
  <h3>Почему программирование стало для меня любимым занятием</h3>
  <p>Программировать я начала 4 года назад. Сначала изучала Python, потом перешла на Ruby и JavaScript.
  </p>
  <p>
    Самым крутым в этом занятии, на мой взгляд, является то, что ты постоянно видишь результат своей работы.
    Написал код, открыл страницу и понял, что создал что-то красивое из ничего. Своего рода творчество, особенно, если делаешь упор на фронтэнд.
  </p>
  <p>
    Еще, конечно же, приятно решать какие-то сложные задачи, которые не под силу большинству других людей.
    Очень хорошо чувствуешь свою важность и значимость.
  </p>
  <p>
    Если же говорить о социальной стороне этого занятия, в айти много
    крутых людей, у которых можно многому научиться и чьей работой можно вдохновиться.
  </p>
</template>

<script>
export default {
}
</script>

<style lang="css" scoped>
 p {
   text-align: center;
   margin-top: 10px;
   margin-bottom: 10px;
 }
</style>